000100231018     A          R LIBLREC                   PFILE(LIBLPF)
000103231018     A            KEYNAME
000104231018     A            LIBRARY
000105231018     A            TYPE
000106231018     A            SEQNO
