000101231115             PGM        PARM(&MOD &RTNSTRING)
000102231115
000103231115             DCL        VAR(&MOD) TYPE(*CHAR) LEN(10)
000104231115             DCL        VAR(&RTNSTRING) TYPE(*CHAR) LEN(5700)
000105231115
000106231115             DCL        VAR(&MODVALUE) TYPE(*CHAR) LEN(10) VALUE('TEST')
000108231115             CHGVAR     VAR(&RTNSTRING) VALUE('? MOD(' *CAT &MODVALUE *CAT ')')
000109231115
000113231115             ENDPGM
000114231115
