000100231019             CMD        PROMPT('Library Load Config Program')
000101231108             PARM       KWD(MODE) TYPE(*CHAR) LEN(10) RSTD(*YES) DFT(*USER) VALUES(*USER +
000103231108                          *ALDON *AURORA *PREAURORA) PROMPT('Select mode')
000104231108
000105231108             /* USER MODE */
000106231108             PARM       KWD(KEYNAME) TYPE(*CHAR) LEN(10) PROMPT('Key name') PMTCTL(USERMODE)
000108231108             PARM       KWD(EVENT) TYPE(*CHAR) LEN(10) RSTD(*YES) DFT(*ALL) VALUES(*ALL +
000109231108                          *CURRENT *USR *SYS) PROMPT('Library type')  PMTCTL(USERMODE)
000110231108
000111231108             /* ALDON MODE */
000112231108
000113231108
000114231108             /* AURORA MODE */
000115231108
000116231108
000117231108             /* PREAURORA MODE */
000118231108
000119231108
000120231108 USERMODE:   PMTCTL     CTL(MODE) COND((*EQ *USER))
