000100231019             CMD        PROMPT('Library Load Config Program')
000101231108             PARM       KWD(MODE) TYPE(*CHAR) LEN(10) RSTD(*YES) DFT(*USER) VALUES(*USER +
000102231108                          *ALDON *AURORA *PREAURORA) PROMPT('Select mode')
000104231108
000105231108             /* USER MODE */
000106231108             PARM       KWD(KEYNAME) TYPE(*CHAR) LEN(10) PROMPT('Key name') PMTCTL(USERMODE)
000108231108             PARM       KWD(EVENT) TYPE(*CHAR) LEN(10) RSTD(*YES) DFT(*ALL) VALUES(*ALL +
000109231108                          *CURRENT *USR *SYS) PROMPT('Library type')  PMTCTL(USERMODE)
000110231108
000111231108             /* ALDON MODE */
000112231108             PARM       KWD(REL) TYPE(@REL) PROMPT('Release') PMTCTL(ALDONMODE)
000113231108             PARM       KWD(ENV) TYPE(*CHAR) LEN(3) RSTD(*YES) VALUES(PDN QUA ITG DVP) +
000114231108                          DFT(PDN) PMTCTL(ALDONMODE) PROMPT('Environment')
000115231108             PARM       KWD(DVPNAME) TYPE(*NAME) LEN(10) DFT(*USERDFT) PMTCTL(ALDONMODE) +
000116231108                          PROMPT('If DVP: Developer name')
000117231108             PARM       KWD(EMGCHK) TYPE(*CHAR) LEN(4) RSTD(*YES) VALUES(*NO *YES) DFT(*NO) +
000118231108                          PMTCTL(ALDONMODE) PROMPT('Emergency checkout')
000119231108
000120231108             PARM       KWD(JOBD) TYPE(@JOBD) PROMPT('Using job description')  PMTCTL(ALDONMODE)
000122231108
000123231108             PARM       KWD(DTASET) TYPE(*NAME) LEN(10) DFT(*NONE) PROMPT('Data set') +
000124231108                          PMTCTL(ALDONMODE)
000125231108             PARM       KWD(EDTLIBL) TYPE(*CHAR) LEN(4) DFT(*YES) VALUES(*NO *YES) RSTD(*YES) +
000126231108                          PROMPT('Edit library list') PMTCTL(ALDONMODE)
000127231108
000129231108             /* AURORA MODE */
000130231108
000131231108
000132231108             /* PREAURORA MODE */
000133231108
000134231108 @REL:       QUAL       TYPE(*NAME) LEN(10) DFT(*USERDFT)
000135231108             QUAL       TYPE(*NAME) LEN(10) PROMPT('Application')
000136231108             QUAL       TYPE(*NAME) LEN(10) PROMPT('Group')
000137231108
000138231108 @JOBD:      QUAL       TYPE(*NAME) LEN(10)
000139231108             QUAL       TYPE(*NAME) LEN(10) PROMPT('Library')
000140231108
000141231108
000142231108 USERMODE:   PMTCTL     CTL(MODE) COND((*EQ *USER))
000143231108 ALDONMODE:  PMTCTL     CTL(MODE) COND((*EQ *ALDON))
